app/controllers/api/lists_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1  [["user_id", 6]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 6]]
---
  def index
    @lists = List.where(user_id: current_user.id).includes(:tasks)

INSERT INTO "lists" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "yfasdsa"], ["user_id", 6], ["created_at", "2020-08-06 22:01:40.602153"], ["updated_at", "2020-08-06 22:01:40.602153"]]
---
  def create
    @list = List.new(list_params)
    @list.user_id = current_user.id
    if @list.save