app/controllers/api/tasks_controller.rb

  def create
    @task = Task.new(task_params)
    (@task.user_id = current_user.id) unless @task.user_id
    @task.status = false
    if @task.save
---
INSERT INTO "tasks" ("title", "completed", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "fdasfdsafdsa"], ["completed", false], ["user_id", 6], ["created_at", "2020-08-04 20:59:27.448121"], ["updated_at", "2020-08-04 20:59:27.448121"]]

  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "due_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["due_date", "2020-12-30"], ["updated_at", "2020-12-06 03:01:06.661895"], ["id", 24]]

    task = Task.find(params[:id])
    task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 7]]