app/models/user.rb

    def self.find_by_credentials(username, password)
        @user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "fdas"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = self.class.generate_session_token
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "wTcNzgujms97C/29LGlrgw=="], ["updated_at", "2020-07-29 17:10:56.932954"], ["id", 13]]